
/********************************************************************************************
头文件
********************************************************************************************/
#include "bsp_uart.h"
/********************************************************************************************
宏定义
********************************************************************************************/

/********************************************************************************************
变量定义
********************************************************************************************/


/********************************************************************************************
函数申明
********************************************************************************************/

 /*****************************************************************************************
** 函数名称：
** 函数描述：uart1发送给canopen数据
** 输入参数：tx_buffer:发送数据的缓存；发送数据的个数
** 返回值  ：无
******************************************************************************************/
#if defined(BSP_USING_UART1)
void bsp_uart1_send_data(uint8_t *buffer, uint16_t len )
{
	rt_device_write(serial_uart1, 0, buffer,  len);
}
#endif


#if defined(BSP_USING_UART4)
void bsp_uart4_send_data(uint8_t *buffer, uint16_t len )
{
	rt_device_write(serial_uart4, 0, buffer,  len);
} 
#endif


#if defined(BSP_USING_UART5)
void bsp_uart5_send_data(uint8_t *buffer, uint16_t len )
{
	rt_device_write(serial_uart5, 0, buffer,  len);
} 
#endif


#if defined(BSP_USING_UART6)
void bsp_uart6_send_data(uint8_t *buffer, uint16_t len )
{
	rt_device_write(serial_uart6, 0, buffer,  len);
} 
#endif